-------------------------------------------------------------
--INITIAL DATA
-------------------------------------------------------------
USE STAFFINFO_TESTS
GO

INSERT INTO EDUCATIONAL_INSTITUTION
	VALUES('ГГУ им. Ф. Скорины', '', 'ВУЗ'),
		('ГТУ им. Сухого', '', 'ВУЗ'),
		('Гомельский Медицинский Университет', '', 'ВУЗ'),
		('ГИИ МЧС', '', 'ВУЗ');

GO

INSERT INTO MILITARY_UNIT
	VALUES('3202','г. Минск'),
		('2505','г. Гомель'),
		('2504','г. Гомель'),
		('2503','г. Гомель'),
		('2502','г. Гомель'),
		('2501','г. Гомель'),
		('2511','г. Гомель'),
		('2512','г. Гомель'),
		('2513','г. Гомель'),
		('2514','г. Гомель'),
		('2515','г. Гомель'),
		('2516','г. Гомель'),
		('2517','г. Гомель'),
		('2518','г. Гомель'),
		('2519','г. Гомель'),
		('2520','г. Гомель'),
		('2521','г. Гомель'),
		('2522','г. Гомель'),
		('2523','г. Гомель'),
		('2524','г. Гомель'),
		('2525','г. Гомель'),
		('2526','г. Гомель');

GO

INSERT INTO RELATIVE_TYPE
	VALUES('Супруг(-а)'),
	('Сын'),('Дочь'),('Мать'),('Отец');

GO

INSERT INTO SPECIALITY
	VALUES('Инженер-взрывотехник', ''),
	('Спасатель',''),
	('Хирург', '');

GO

INSERT INTO PASPORT
	VALUES('Гомельский РОВД', 226023, 'HB'),
	('Гомельский РОВД', 226012, 'HB'),
	('Гомельский РОВД', 222123, 'HB'),
	('Гомельский РОВД', 232017, 'HB'),
	('Гомельский РОВД', 232127, 'HB');
GO

INSERT INTO EMPLOYEE
	VALUES('Иван', 'Петрович', 'Васильев','Г-11423',1,2,'1972-01-01', '2000-02-04', 'Гомель#ул. Владимирова#123#32', 1, '+375(44)123-44-55','88-77-23', 0, NULL),
	('Сергей', 'Сергеевич', 'Петров', 'Г-10233', 2,3, '1973-04-07', '2002-10-07', 'Гомель#ул. Бочкина#234#2342', 2, '+375(29)856-77-12','67-45-63', 0, NULL),
	('Аристарх', 'Степанович', 'Кузнецов', 'Г-10443', 1,1, '1979-02-11', '2004-04-02', 'Гомель#ул. Советская#232#12', 3, '+375(25)447-63-09','88-98-99', 0, NULL),
	('Евпатий', 'Олегович', 'Сидоров', 'Г-13228', 3,3, '1976-01-12', '2002-05-01', 'Гомель#ул. Тимофеенки#21#12', 4, '+375(44)128-98-45','22-25-05', 0, NULL),
	('Иван', 'Геннадьевич', 'Нестеренко', 'Г-12673', 12,4, '1974-03-11', '2016-04-22', 'Гомель#ул. Советская#212#442', 3, '+375(25)412-61-19','88-08-19', 0, NULL)

GO

INSERT INTO SERTIFICATION
	VALUES(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', ''),
	(1, '2016-01-01', '');
GO

INSERT INTO HOLIDAY_TIME
	VALUES(1 , '', '2002-02-02', '2002-02-05');

GO

INSERT INTO CLASINESS
	VALUES(3,2,'2000-03-02',2,'decsription');

GO

INSERT INTO CONTRACT
	VALUES(1,'2000-01-06', '2002-02-01', 'decsription');

GO

INSERT INTO EDUCATION_TIME
	VALUES(2, '1990-01-06', '1995-02-01', 1, 1, 'education_time_description');