-------------------------------------------------------------
--INITIAL DATA
-------------------------------------------------------------
USE STAFFINFO_TESTS
GO

INSERT INTO EDUCATIONAL_INSTITUTION
	VALUES('ГГУ им. Ф. Скорины', '', 'ВУЗ'),
		('ГТУ им. Сухого', '', 'ВУЗ'),
		('Гомельский Медицинский Университет', '', 'ВУЗ'),
		('ГИИ МЧС', '', 'ВУЗ');

GO

INSERT INTO MILITARY_UNIT
	VALUES('3202','г. Минск'),
		('2505','г. Гомель');

GO

INSERT INTO RELATIVE_TYPE
	VALUES('Супруг(-а)'),
	('Сын'),('Дочь'),('Мать'),('Отец');

GO

INSERT INTO SPECIALITY
	VALUES('Инженер-взрывотехник', ''),
	('Спасатель',''),
	('Хирург', '');

GO

INSERT INTO PASPORT
	VALUES('Гомельский РОВД', 226023, 'HB'),
	('Гомельский РОВД', 226012, 'HB'),
	('Гомельский РОВД', 222123, 'HB'),
	('Гомельский РОВД', 232017, 'HB');
GO

INSERT INTO EMPLOYEE
	VALUES('Иван', 'Петрович', 'Васильев',11423,1,2,'1972-01-01', '2000-02-04', 'Гомель#ул. Владимирова#123#32', 1, '+375441234455','887723', 0, NULL),
	('Сергей', 'Сергеевич', 'Петров', 10233, 2,3, '1973-04-07', '2002-10-07', 'Гомель#ул. Бочкина#234#2342', 2, '+375298567712','674563', 0, NULL),
	('Аристарх', 'Степанович', 'Кузнецов', 10443, 1,1, '1979-02-11', '2004-04-02', 'Гомель#ул. Советская#232#12', 3, '+375254476309','889899', 0, NULL),
	('Евпатий', 'Олегович', 'Сидоров', 13228, 3,3, '1976-01-12', '2002-05-01', 'Гомель#ул. Тимофеенки#21#12', 4, '+375441289845','222505', 0, NULL);

GO

INSERT INTO CLASINESS
	VALUES(3,2,'2000-03-02',2,'decsription');

GO

INSERT INTO CONTRACT
	VALUES(1,'2000-01-06', '2002-02-01', 'decsription');

GO

INSERT INTO EDUCATION_TIME
	VALUES(2, '1990-01-06', '1995-02-01', 1, 1, 'education_time_description');